In [2]:
import pandas as pd

In [9]:
# Load Customers Data
customers_df = pd.read_excel(r"C:\Projects\Global Super Store\2.Processing\Sales Super Store Dataset.xlsx",sheet_name='Customer')
customers_df.head()

  Customer ID     Customer Name
0    RH-19495       Rick Hansen
1    JR-16210     Justin Ritter
2    CR-12730      Craig Reiter
3    KM-16375  Katherine Murray
4     RH-9495       Rick Hansen

In [68]:
# Load Global Superstore Data
global_superstore_df = pd.read_excel(r"C:\Projects\Global Super Store\2.Processing\Sales Super Store Dataset.xlsx",sheet_name ='Global-Superstore')
global_superstore_df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode Code,Customer ID,Segment Code,City,State,Country,Market,Region,Product ID,Sales,Quantity,Discount,Profit,Shipping Cost,Order Priority,Unnamed: 19
0,31302,CA-2011-115812,2011-09-06,2011-06-14,4,BH-11710,1,Los Angeles,California,United States,US,West,FUR-FU-10001487,49,7,0.0,14,3,Medium,28.571429
1,31303,CA-2011-115812,2011-09-06,2011-06-14,4,BH-11710,1,Los Angeles,California,United States,US,West,OFF-AR-10002833,7,4,0.0,2,0,Medium,NaN
2,31306,CA-2011-115812,2011-09-06,2011-06-14,4,BH-11710,1,Los Angeles,California,United States,US,West,OFF-AP-10002892,115,5,0.0,34,8,Medium,NaN
3,31339,CA-2013-101343,2013-07-18,2013-07-23,4,RA-19885,2,Los Angeles,California,United States,US,West,OFF-ST-10003479,78,2,0.0,4,4,Medium,NaN
4,31359,CA-2012-135545,2012-11-24,2012-11-30,4,KM-16720,1,Los Angeles,California,United States,US,West,TEC-AC-10004633,14,2,0.0,6,1,Medium,NaN

In [33]:
# Load Products Data
product_df = pd.read_excel(r"C:\Projects\Global Super Store\2.Processing\Sales Super Store Dataset.xlsx",sheet_name ='Product')
product_df.head()

,Product ID,Category,Sub-Category,Product Name
0,OFF-PA-10000994,Office Supplies,Paper,Xerox 1915
1,OFF-PA-10003395,Office Supplies,Paper,Xerox 1941
2,OFF-EAT-10002122,Office Supplies,Paper,"Eaton Cards & Envelopes, 8.5 x 11"
3,OFF-PA-10000418,Office Supplies,Paper,Xerox 189
4,OFF-PA-10002196,Office Supplies,Paper,"Green Bar Message Books, Recycled"

In [34]:
# Load Segments Data
segment_df = pd.read_excel(r"C:\Projects\Global Super Store\2.Processing\Sales Super Store Dataset.xlsx",sheet_name ='Segment')
segment_df.head()

   Segment Code      Segment
0             1     Consumer
1             2    Corporate
2             3  Home Office

In [36]:
# Load Shipping Modes Data
ship_mode_df = pd.read_excel(r"C:\Projects\Global Super Store\2.Processing\Sales Super Store Dataset.xlsx",sheet_name ='Ship Mode')
ship_mode_df.head()

        Ship Mode  Ship Mode Code
0        Same Day               1
1    Second Class               2
2     First Class               3
3  Standard Class               4

## 1.How many Customers made orders for each year?

In [69]:
# Table: global_superstore_df
# Columns:
#  Order Date: Date value of each transaction 
#  Customer ID: ID value of each customer
total_customers_df = global_superstore_df
total_customers_df['Year'] = total_customers_df['Order Date'].dt.year
total_customers_df.groupby('Year')['Customer ID'].nunique()

Year
2011    1309
2012    1373
2013    1458
2014    1511
Name: Customer ID, dtype: int64

## 2.How many Products sold for each Year?

In [73]:
# Table: global_superstore_df
# Columns:
#  Year: Year value of each transaction 
#  Product ID: ID value of each product
total_products_df = global_superstore_df
total_products_df = total_products_df.groupby('Year')['Product ID'].nunique()
total_products_df

Year
2011    5678
2012    6299
2013    7074
2014    7885
Name: Product ID, dtype: int64

## 3.What is the Total value of Shipping Cost for each year?

In [74]:
# Table: global_superstore_df
# Columns:
#  Year: Year value of each transaction 
#  Shipping Cost: Shipping Cost value of each order
total_shipping_cost = global_superstore_df
total_shipping_cost = total_shipping_cost.groupby('Year')['Shipping Cost'].sum()
total_shipping_cost

Year
2011    244334
2012    283490
2013    364599
2014    460528
Name: Shipping Cost, dtype: int64

## 4.What is the Total Sale value of each Year?

In [75]:
# Table: global_superstore_df
# Columns:
#  Year: Year value of each transaction 
#  Sales: Sales value of each transaction     
total_sales_df = global_superstore_df
total_sales_df = total_sales_df.groupby('Year')['Sales'].sum()
total_sales_df

Year
2011    2259511
2012    2677493
2013    3405860
2014    4300041
Name: Sales, dtype: int64

## 5.What is the Total Sale value by each Year and Month?

In [78]:
# Table: global_superstore_df
# Columns:
#  Year: Year value of each transaction 
#  Sales: Sales value of each transaction

month_order = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun',
                   'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']

total_sales_df = global_superstore_df

total_sales_df['Month'] = total_sales_df['Order Date'].dt.month_name().str[:3]
total_sales_df['Month_Name'] = pd.Categorical(total_sales_df['Month'], categories=month_order, ordered=True)

total_sales_df = total_sales_df.groupby(['Year','Month_Name'],as_index=False)['Sales'].sum()
total_sales_df.sort_values(by=['Year','Month_Name'])

C:\Users\mahes\AppData\Local\Temp\ipykernel_19980\449270823.py:12: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  total_sales_df = total_sales_df.groupby(['Year','Month_Name'],as_index=False)['Sales'].sum()

    Year Month_Name   Sales
0   2011        Jan  138245
1   2011        Feb  134969
2   2011        Mar  171445
3   2011        Apr  128843
4   2011        May  148158
5   2011        Jun  189339
6   2011        Jul  162039
7   2011        Aug  219236
8   2011        Sep  255250
9   2011        Oct  204679
10  2011        Nov  214931
11  2011        Dec  292377
12  2012        Jan  162807
13  2012        Feb  152663
14  2012        Mar  201626
15  2012        Apr  187470
16  2012        May  218953
17  2012        Jun  249284
18  2012        Jul  174403
19  2012        Aug  271675
20  2012        Sep  256592
21  2012        Oct  239324
22  2012        Nov  270725
23  2012        Dec  291971
24  2013        Jan  206467
25  2013        Feb  191077
26  2013        Mar  230551
27  2013        Apr  233188
28  2013        May  304523
29  2013        Jun  341161
30  2013        Jul  223649
31  2013        Aug  323889
32  2013        Sep  326904
33  2013        Oct  270131
34  2013        Nov  383051
35  2013        Dec  371269
36  2014        Jan  268275
37  2014        Feb  244179
38  2014        Mar  347757
39  2014        Apr  302140
40  2014        May  304795
41  2014        Jun  372608
42  2014        Jul  278670
43  2014        Aug  432742
44  2014        Sep  405455
45  2014        Oct  406676
46  2014        Nov  508985
47  2014        Dec  427759